docs: update project README.
